<?php

namespace Database\Seeders\Products;

use App\Models\Products\Categories\ProductCategory;
use App\Models\Products\Categories\ProductSubCategory;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class ProductCategorySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $data = [
            // دسته مناسبت‌های مذهبی و ملی
            [
                'name' => 'مناسبت',
                'sub_categories' => [
                    'شعبان',
                    'محرم',
                    'تاسوعا',
                    'عاشورا',
                    'شام غریبان',
                    'صفر',
                    'فاطمیه',
                    'شعبانیه',
                    'دهه فجر',
                    'غدیر',
                    'شب قدر',
                    'اربعین',
                    'نیمه شعبان',
                    'عید فطر',
                    'عید قربان',
                    'عید غدیر',
                    'عید مبعث',
                    'عید نوروز',
                    'روز جمهوری اسلامی',
                    '۲۲ بهمن',
                    'روز ارتش',
                    'روز معلم',
                    'هفته دفاع مقدس',
                    'دهه کرامت',
                    'چهارشنبه سوری',
                    'شب یلدا',
                    'سیزده بدر',
                ],
            ],

            // دسته اهل بیت و امامان
            [
                'name' => 'ائمه اطهار',
                'sub_categories' => [
                    'حضرت محمد (ص)',
                    'امام علی (ع)',
                    'حضرت فاطمه (س)',
                    'امام حسن (ع)',
                    'امام حسین (ع)',
                    'امام سجاد (ع)',
                    'امام باقر (ع)',
                    'امام صادق (ع)',
                    'امام کاظم (ع)',
                    'امام رضا (ع)',
                    'امام جواد (ع)',
                    'امام هادی (ع)',
                    'امام حسن عسکری (ع)',
                    'امام زمان (ع)',
                ],
            ],

            [
                'name' => 'اهل‌بیت و وابستگان',
                'sub_categories' => [
                    'حضرت عباس (ع)',
                    'حضرت زینب (س)',
                    'علی اکبر (ع)',
                    'علی اصغر (ع)',
                    'حضرت رقیه (س)',
                    'ابوطالب (ع)',
                    'حضرت ام‌البنین (س)',
                    ' مسلم بن عقیل',
                    'حر بن یزید ریاحی',
                    'قاسم بن حسن',
                    'عبدالله بن حسن',
                    'زهیر بن قین',
                ],
            ],
            [
                'name' => 'شهدای شاخص',
                'sub_categories' => [
                    'شهید سلیمانی',
                    'شهید باکری',
                    'شهید همت',
                    'شهید صیاد شیرازی',
                    'شهید مطهری',
                    'شهید چمران',
                    'شهید اندرزگو',
                    'شهید حججی',
                    'شهید آوینی',
                    'شهید بهشتی',
                    'شهید رجایی',
                    'شهید باهنر',
                    'شهید دستغیب',
                ],
            ],
            [
                'name' => 'رهبران و بزرگان انقلاب',
                'sub_categories' => [
                    'امام خمینی',
                    'رهبری',
                    'علامه طباطبایی',
                    'آیت‌الله بهجت',
                    'آیت‌الله سیدعلی قاضی',
                ],
            ],

            // دسته وقایع
            [
                'name' => 'شهادت یا ولادت',
                'sub_categories' => [
                    'شهادت',
                    'ولادت',
                ],
            ],

            // مکان‌های مذهبی و زیارتگاه‌ها
            [
                'name' => 'مکان‌های مذهبی',
                'sub_categories' => [
                    'کربلا',
                    'نجف',
                    'مشهد',
                    'قم',
                    'جمکران',
                    'سامرا',
                    'کاظمین',
                    'بقیع',
                    'شام',
                ],
            ],

            // ادعیه و زیارات
            [
                'name' => 'ادعیه و زیارات',
                'sub_categories' => [
                    'زیارت عاشورا',
                    'زیارت ال یاسین',
                    'زیارت اربعین',
                    'دعای توسل',
                    'دعای کمیل',
                    'دعای ندبه',
                    'دعای جوشن کبیر',
                ],
            ],

            // پرچم‌ها، کشورها، گروه‌ها، سازمان‌ها
            [
                'name' => 'پرچم کشورها',
                'sub_categories' => [
                    'ایران',
                    'عراق',
                    'سوریه',
                    'لبنان',
                    'یمن',
                    'فلسطین',
                    'تاجیکستان',
                    'عمان',
                    'امارات',
                    'کویت',
                    'اندونزی',
                    'روسیه',
                    'سنگاپور',
                    'ترکمنستان',
                    'پرتغال',
                    'استرالیا',
                    'فرانسه',
                    'ایتالیا',
                    'ازبکستان',
                    'هلند',
                    'ترکیه',
                    'اردن',
                    'افغانستان',
                    'مالزی',
                    'مصر',
                    'هند',
                    'اکراین',
                    'المان',
                    'قطر',
                    'چین',
                    'عربستان',
                    'بحرین',
                    'ونزوئلا',
                    'اذربایجان',
                    'ارمنستان',
                    'قزاقستان',
                    'پاکستان',
                ],
            ],
            [
                'name' => 'پرچم و نماد گروه‌ها و سازمان‌ها',
                'sub_categories' => [
                    'ارتش',
                    'سپاه',
                    'نیرو انتظامی',
                    'حشد الشعبی',
                    'حزب الله',
                    'فاطمیون',
                    'زینبیون',
                    'حماس',
                    'قدس',
                    'نصرالله',
                    'بسیج',
                    'قاطمیون',
                ],
            ],

            // دسته پیشنهادی برای مناسبت‌های ملی/اجتماعی (در صورت نیاز)
            [
                'name' => 'مناسبت‌های ملی و اجتماعی',
                'sub_categories' => [
                    'روز معلم',
                    'روز دانش‌آموز',
                    'روز کارگر',
                    'هفته بسیج',
                    'هفته وحدت',
                    'هفته پژوهش',
                    'روز پرستار',
                ],
            ],
        ];

        foreach ($data as $catData) {
            $category = ProductCategory::updateOrCreate(['name' => $catData['name']]);

            foreach ($catData['sub_categories'] as $subName) {
                ProductSubCategory::updateOrCreate([
                    'category_id' => $category->id,
                    'name'        => $subName,
                ]);
            }
        }
    }
}
